modules/Car/Controllers/CarController.php

select * from `car_pickup_locations` where `car_pickup_locations`.`id` = 4 limit 1
---
        $pickupLocationId = Arr::get($pickupPayload, 'id') ?? $request->input('pickup_location_id');
        $selectedPickupLocation = null;
        if ($pickupLocationId) {
            $selectedPickupLocation = CarPickupLocation::with('car')->find($pickupLocationId);

select * from `car_pickup_locations` where `car_pickup_locations`.`car_id` = 16 and `car_pickup_locations`.`car_id` is not null and `id` = '4' and `is_active` = 1 limit 1
---
    public function quote(Request $request, Car $car)
    {
        if ($car->status !== 'publish') {
            return $this->sendError(__('transfers.booking.price_details_unavailable'), [], 404);
        }

        $passengers = (int) $request->input('passengers', 1);
        if ($passengers < 1) {
            $passengers = 1;
        }
        $maxPassengers = (int) ($car->number ?? 0);
        if ($maxPassengers > 0 && $passengers > $maxPassengers) {
            $passengers = $maxPassengers;
        }

        $pickupPayload = $request->input('pickup');
        if (is_string($pickupPayload)) {
            $decodedPickup = json_decode($pickupPayload, true);
            if (json_last_error() === JSON_ERROR_NONE) {
                $pickupPayload = $decodedPickup;
            }
        }
        if (!is_array($pickupPayload)) {
            $pickupPayload = [];
        }

        $pickupLocationId = $request->input('pickup_location_id') ?? Arr::get($pickupPayload, 'id');
        $pickupLocation = null;
        if ($pickupLocationId) {
            $pickupLocation = $car->pickupLocations()
                ->where('id', $pickupLocationId)
                ->where('is_active', true)
                ->first();

select * from `car_pickup_locations` where `car_pickup_locations`.`car_id` in (16)
---
    public function detail(Request $request, $slug)
    {
        $row = $this->carClass::where('slug', $slug)->with(['location','translation','hasWishList','pickupLocations.car'])->first();