modules/Car/Controllers/CarController.php

    public function detail(Request $request, $slug)
    {
        $row = $this->carClass::where('slug', $slug)->with(['location','translation','hasWishList','pickupLocations.car'])->first();
        if ( empty($row) or !$row->hasPermissionDetailView()) {
            return redirect('/');
        }
        $translation = $row->translate();
        $car_related = [];
        $location_id = $row->location_id;
        if (!empty($location_id)) {
            $car_related = $this->carClass::where('location_id', $location_id)->where("status", "publish")->take($this->limitRelated ?? 4)->whereNotIn('id', [$row->id])->with(['location','translation','hasWishList'])->get();
        }
        $review_list = $row->getReviewList();

        $pickupPayload = $request->input('pickup');
        if (is_string($pickupPayload)) {
            $decodedPickup = json_decode($pickupPayload, true);
            if (json_last_error() === JSON_ERROR_NONE) {
                $pickupPayload = $decodedPickup;
            }
        }
        if (!is_array($pickupPayload)) {
            $pickupPayload = [];
        }

        $selectedPickupLocation = null;
        $pickupLocationId = Arr::get($pickupPayload, 'id') ?? $request->input('pickup_location_id');
        if ($pickupLocationId) {
            $selectedPickupLocation = $row->pickupLocations()->where('id', $pickupLocationId)->where('is_active', true)->first();
---
select * from `car_pickup_locations` where `car_pickup_locations`.`car_id` = 16 and `car_pickup_locations`.`car_id` is not null and `id` = '2' and `is_active` = 1 limit 1