modules/Car/Models/Car.php

    public function getDatesInRange($start_date,$end_date)
    {
        $query = $this->carDateClass::query();
        $query->where('target_id',$this->id);
        $query->where('start_date','>=',date('Y-m-d H:i:s',strtotime($start_date)));
        $query->where('end_date','<=',date('Y-m-d H:i:s',strtotime($end_date)));
        $query->orderBy('start_date');
        if ($this->author_id) {
            $query->orderByRaw('CASE WHEN create_user = ? THEN 0 ELSE 1 END ASC', [$this->author_id]);
        }

        return $query->take(100)->get();
---
select * from `bravo_car_dates` where `target_id` = 16 and `start_date` >= '2025-11-20 00:00:00' and `end_date` <= '2025-11-20 23:59:59' order by `start_date` asc, CASE WHEN create_user = 6 THEN 0 ELSE 1 END ASC limit 100

    public function getBookingData()
    {
        if (!empty($start = request()->input('start'))) {
            $start_html = display_date($start);
            $end_html = request()->input('end') ? display_date(request()->input('end')) : "";
            $date_html = $start_html . '<i class="fa fa-long-arrow-right" style="font-size: inherit"></i>' . $end_html;
        }
        $booking_data = [
            'id'              => $this->id,
            'extra_price'     => [],
            'minDate'         => date('m/d/Y'),
            'max_number'      => $this->number ?? 1,
            'buyer_fees'      => [],
            'start_date'      => request()->input('start') ?? "",
            'start_date_html' => $date_html ?? __('Please select date!'),
            'end_date'        => request()->input('end') ?? "",
            'deposit'=>$this->isDepositEnable(),
            'deposit_type'=>$this->getDepositType(),
            'deposit_amount'=>$this->getDepositAmount(),
            'deposit_fomular'=>$this->getDepositFomular(),
            'is_form_enquiry_and_book'=> $this->isFormEnquiryAndBook(),
            'enquiry_type'=> $this->getBookingEnquiryType(),
        ];
        $pickupLocationId = request()->input('pickup_location_id');
        if ($pickupLocationId) {
            $pickupLocation = CarPickupLocation::query()
                ->availableForCar($this)
                ->where('id', $pickupLocationId)
                ->first();
---
select * from `car_pickup_locations` where `car_pickup_locations`.`car_id` = 16 and `car_pickup_locations`.`car_id` is not null and `id` = '5' limit 1