modules/Car/Models/Car.php

    public function getDatesInRange($start_date,$end_date)
    {
        $query = $this->carDateClass::query();
        $query->where('target_id',$this->id);
        $query->where('start_date','>=',date('Y-m-d H:i:s',strtotime($start_date)));
        $query->where('end_date','<=',date('Y-m-d H:i:s',strtotime($end_date)));

        return $query->take(100)->get();
---
select * from `bravo_car_dates` where `target_id` = 16 and `start_date` >= '2025-11-14 00:00:00' and `end_date` <= '2025-11-14 23:59:59' limit 100