modules/Tour/Models/Tour.php

select * from `bravo_tour_meta` where `tour_id` = 23 limit 1
---
    public function saveMeta(\Illuminate\Http\Request $request)
    {
        $meta = $this->tourMetaClass::where('tour_id', $this->id)->first();

select count(`id`) as aggregate from `bravo_tour_dates` where (`start_date` >= '2025-11-12' and `end_date` <= '2025-11-12' and `active` = '0' and `target_id` = 23)
---
    public function isAvailableInRanges($start_date){

        if($this->default_state)
        {
            $notAvailableDates = $this->tourDateClass::query()->where([
                ['start_date','>=',$start_date],
                ['end_date','<=',$start_date],
                ['active','0'],
                ['target_id','=',$this->id],
            ])->count('id');

select count(`bravo_tours`.`id`) as aggregate from `bravo_tours` inner join `bravo_locations` on `bravo_locations`.`id` = `bravo_tours`.`location_id` and `bravo_locations`.`_lft` >= 46 and `bravo_locations`.`_rgt` <= 47 where `bravo_tours`.`status` = 'publish' and `bravo_tours`.`deleted_at` is null
---
    public function getNumberServiceInLocation($location)
    {
        $number = 0;
        if (!empty($location)) {
            $number = parent::join('bravo_locations', function ($join) use ($location) {
                $join->on('bravo_locations.id', '=', 'bravo_tours.location_id')->where('bravo_locations._lft', '>=', $location->_lft)->where('bravo_locations._rgt', '<=', $location->_rgt);
            })->where("bravo_tours.status", "publish")->with(['translation'])->count("bravo_tours.id");