modules/Car/Admin/CarController.php

delete from `bravo_car_term` where `target_id` = 16
---
    public function saveTerms($row, $request)
    {
        $this->checkPermission('car_manage_attributes');
        if (empty($request->input('terms'))) {
            $this->car_term::where('target_id', $row->id)->delete();